app/controllers/logins_controller.rb

SELECT  "registrations".* FROM "registrations" WHERE "registrations"."email" = ? LIMIT ?  [["email", "skr"], ["LIMIT", 1]]
---
  def create

    reg = Registration.find_by_email(params[:email])