app/controllers/password_resets_controller.rb

SELECT  "registrations".* FROM "registrations" WHERE "registrations"."email" = ? LIMIT ?  [["email", "rajypr1@gmail.com"], ["LIMIT", 1]]
---
  def create
  reg = Registration.find_by_email(params[:email])