app/controllers/profiles_controller.rb

SELECT  "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
	def show
@reg = Registration.find_by id: session[:reg_id]

SELECT  "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
def edit
@reg=Registration.find_by id: session[:reg_id]

SELECT  "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "registrations" SET "name" = ?, "password_digest" = ?, "onebhk" = ?, "updated_at" = ? WHERE "registrations"."id" = ?  [["name", "demosa"], ["password_digest", "$2a$10$dwQdTv5BAhPCkPt0ob9Fne1sGXpyDiU3etQPXHn93oAtrJ0G.8UMG"], ["onebhk", "Yes"], ["updated_at", 2017-05-19 10:55:00 UTC], ["id", 14]]
---
def update
@reg=Registration.find_by id: session[:reg_id]
if(@reg.update(reg_params))

SELECT  "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "registrations" WHERE "registrations"."id" = ?  [["id", 14]]
---
def destroy
@reg=Registration.find_by id: session[:reg_id]
@reg.destroy