app/controllers/registrations_controller.rb

	def create
    @reg = Registration.new(reg_params)
    if @reg.save
---
INSERT INTO "registrations" ("name", "phone", "email", "password_digest", "city", "area", "typeofroom", "onebhk", "twobhk", "threebhk", "created_at", "updated_at", "auth_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def index
     @areas = Registration.find_by_sql("SELECT area FROM registrations GROUP BY area").map &:area
    @reg = params[:area].blank? ? Registration.all : Registration.where(area: params[:area])
---
SELECT  "registrations".* FROM "registrations" WHERE "registrations"."area" = ? LIMIT ?  [["area", "1"], ["LIMIT", 1]]